tap "cjbassi/gotop"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "timothyye/tap"
# Download with resuming and segmented downloading
brew "aria2"
# Automatic configure script builder
brew "autoconf"
# Shell extension to jump to frequently used directories
brew "autojump"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Cross-platform make
brew "cmake"
# Music player with an ncurses based interface
brew "cmus"
# Dependency Manager for PHP
brew "composer"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU compiler collection
brew "gcc"
# Distributed revision control system
brew "git"
# C library for reading, creating, and modifying zip archives
brew "libzip"
# Keep your Mac's application settings in sync
brew "mackup"
# HTTP(S) server and reverse proxy, and IMAP/POP3 proxy server
brew "nginx"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Password generator
brew "pwgen"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Persistent key-value database, with built-in net interface
brew "redis"
# Programatically correct mistyped console commands
brew "thefuck"
# Text interface for Git repositories
brew "tig"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Pager/text based browser
brew "w3m"
# Internet file retriever
brew "wget"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# A terminal based graphical activity monitor inspired by gtop and vtop
brew "cjbassi/gotop/gotop"
# A command-line tool to query exchange rate
brew "timothyye/tap/exchangerate"
cask "another-redis-desktop-manager"
cask "font-hack-nerd-font"
cask "keycastr"
cask "launchrocket"
cask "qlcolorcode"
cask "qlmarkdown"
cask "quicklook-json"
cask "selfcontrol"
